export const CATEGORIES = [
  { id: 'all', name: '全部类型' },
  { id: '哈希', name: '1. 哈希 (3)' },
  { id: '双指针', name: '2. 双指针 (4)' },
  { id: '滑动窗口', name: '3. 滑动窗口 (2)' },
  { id: '子串', name: '4. 子串 (3)' },
  { id: '普通数组', name: '5. 普通数组 (5)' },
  { id: '矩阵', name: '6. 矩阵 (4)' },
  { id: '链表', name: '7. 链表 (14)' },
  { id: '二叉树', name: '8. 二叉树 (15)' },
  { id: '图论', name: '9. 图论 (4)' },
  { id: '回溯', name: '10. 回溯 (8)' },
  { id: '二分查找', name: '11. 二分查找 (6)' },
  { id: '栈', name: '12. 栈 (5)' },
  { id: '堆', name: '13. 堆 (3)' },
  { id: '贪心算法', name: '14. 贪心算法 (4)' },
  { id: '动态规划', name: '15. 动态规划 (10)' },
  { id: '多维动态规划', name: '16. 多维动态规划 (5)' },
  { id: '技巧', name: '17. 技巧 (5)' }
];

export const DIFFICULTIES = [
  { id: 'all', name: '全部难度' },
  { id: '简单', name: '简单' },
  { id: '中等', name: '中等' },
  { id: '困难', name: '困难' },
];
